stm32duino/LSM6DSO32/src/lsm6dso32_reg.h
/*
 * These are the basic platform dependent I/O routines to read
 * and write device registers connected on a standard bus.
 * The driver keeps offering a default implementation based on function
 * pointers to read/write routines for backward compatibility.
 * The __weak directive allows the final application to overwrite
 * them with a custom implementation.
 */

int32_t lsm6dso32_read_reg(const stmdev_ctx_t *ctx, uint8_t reg,
                           uint8_t *data,
                           uint16_t len);
int32_t lsm6dso32_write_reg(const stmdev_ctx_t *ctx, uint8_t reg,
                            uint8_t *data,
                            uint16_t len);

float  lsm6dso32_from_fs4_to_mg(int16_t lsb);
float  lsm6dso32_from_fs8_to_mg(int16_t lsb);
float  lsm6dso32_from_fs16_to_mg(int16_t lsb);
float  lsm6dso32_from_fs32_to_mg(int16_t lsb);

float  lsm6dso32_from_fs125_to_mdps(int16_t lsb);
float  lsm6dso32_from_fs250_to_mdps(int16_t lsb);
float  lsm6dso32_from_fs500_to_mdps(int16_t lsb);
float  lsm6dso32_from_fs1000_to_mdps(int16_t lsb);
float  lsm6dso32_from_fs2000_to_mdps(int16_t lsb);

float  lsm6dso32_from_lsb_to_celsius(int16_t lsb);

float  lsm6dso32_from_lsb_to_nsec(int16_t lsb);

typedef enum
{
  LSM6DSO32_4g     = 0x00,
  LSM6DSO32_8g     = 0x02,
  LSM6DSO32_16g    = 0x03,
  LSM6DSO32_32g    = 0x01,
} lsm6dso32_fs_xl_t;
int32_t lsm6dso32_xl_full_scale_set(const stmdev_ctx_t *ctx,
                                    lsm6dso32_fs_xl_t val);
int32_t lsm6dso32_xl_full_scale_get(const stmdev_ctx_t *ctx,
                                    lsm6dso32_fs_xl_t *val);

typedef enum
{
  /* Accelerometer power off */
  LSM6DSO32_XL_ODR_OFF                     = 0x00,
  /* Accelerometer low power mode */
  LSM6DSO32_XL_ODR_1Hz6_LOW_PW             = 0x1B,
  LSM6DSO32_XL_ODR_12Hz5_LOW_PW            = 0x11,
  LSM6DSO32_XL_ODR_26Hz_LOW_PW             = 0x12,
  LSM6DSO32_XL_ODR_52Hz_LOW_PW             = 0x13,
  /* Accelerometer normal mode */
  LSM6DSO32_XL_ODR_104Hz_NORMAL_MD         = 0x14,
  LSM6DSO32_XL_ODR_208Hz_NORMAL_MD         = 0x15,
  /* Accelerometer high performance */
  LSM6DSO32_XL_ODR_12Hz5_HIGH_PERF         = 0x01,
  LSM6DSO32_XL_ODR_26Hz_HIGH_PERF          = 0x02,
  LSM6DSO32_XL_ODR_52Hz_HIGH_PERF          = 0x03,
  LSM6DSO32_XL_ODR_104Hz_HIGH_PERF         = 0x04,
  LSM6DSO32_XL_ODR_208Hz_HIGH_PERF         = 0x05,
  LSM6DSO32_XL_ODR_417Hz_HIGH_PERF         = 0x06,
  LSM6DSO32_XL_ODR_833Hz_HIGH_PERF         = 0x07,
  LSM6DSO32_XL_ODR_1667Hz_HIGH_PERF        = 0x08,
  LSM6DSO32_XL_ODR_3333Hz_HIGH_PERF        = 0x09,
  LSM6DSO32_XL_ODR_6667Hz_HIGH_PERF        = 0x0A,
  /* Accelerometer ultra low power.
   * WARNING: Gyroscope must be in Power-Down mode when
   *          accelerometer is in ultra low power mode.
   */
  LSM6DSO32_XL_ODR_1Hz6_ULTRA_LOW_PW       = 0x2B,
  LSM6DSO32_XL_ODR_12Hz5_ULTRA_LOW_PW      = 0x21,
  LSM6DSO32_XL_ODR_26Hz_ULTRA_LOW_PW       = 0x22,
  LSM6DSO32_XL_ODR_52Hz_ULTRA_LOW_PW       = 0x23,
  LSM6DSO32_XL_ODR_104Hz_ULTRA_LOW_PW      = 0x24,
  LSM6DSO32_XL_ODR_208Hz_ULTRA_LOW_PW      = 0x25,
} lsm6dso32_odr_xl_t;
int32_t lsm6dso32_xl_data_rate_set(const stmdev_ctx_t *ctx,
                                   lsm6dso32_odr_xl_t val);
int32_t lsm6dso32_xl_data_rate_get(const stmdev_ctx_t *ctx,
                                   lsm6dso32_odr_xl_t *val);

typedef enum
{
  LSM6DSO32_250dps   = 0,
  LSM6DSO32_125dps   = 1,
  LSM6DSO32_500dps   = 2,
  LSM6DSO32_1000dps  = 4,
  LSM6DSO32_2000dps  = 6,
} lsm6dso32_fs_g_t;
int32_t lsm6dso32_gy_full_scale_set(const stmdev_ctx_t *ctx,
                                    lsm6dso32_fs_g_t val);
int32_t lsm6dso32_gy_full_scale_get(const stmdev_ctx_t *ctx,
                                    lsm6dso32_fs_g_t *val);

typedef enum
{
  /* Gyroscope power off */
  LSM6DSO32_GY_ODR_OFF                  = 0x00,
  /* Gyroscope high performance mode */
  LSM6DSO32_GY_ODR_12Hz5_HIGH_PERF      = 0x01,
  LSM6DSO32_GY_ODR_26Hz_HIGH_PERF       = 0x02,
  LSM6DSO32_GY_ODR_52Hz_HIGH_PERF       = 0x03,
  LSM6DSO32_GY_ODR_104Hz_HIGH_PERF      = 0x04,
  LSM6DSO32_GY_ODR_208Hz_HIGH_PERF      = 0x05,
  LSM6DSO32_GY_ODR_417Hz_HIGH_PERF      = 0x06,
  LSM6DSO32_GY_ODR_833Hz_HIGH_PERF      = 0x07,
  LSM6DSO32_GY_ODR_1667Hz_HIGH_PERF     = 0x08,
  LSM6DSO32_GY_ODR_3333Hz_HIGH_PERF     = 0x09,
  LSM6DSO32_GY_ODR_6667Hz_HIGH_PERF     = 0x0A,
  /* Gyroscope normal mode */
  LSM6DSO32_GY_ODR_104Hz_NORMAL_MD      = 0x14,
  LSM6DSO32_GY_ODR_208Hz_NORMAL_MD      = 0x15,
  /* Gyroscope low power mode */
  LSM6DSO32_GY_ODR_12Hz5_LOW_PW         = 0x11,
  LSM6DSO32_GY_ODR_26Hz_LOW_PW          = 0x12,
  LSM6DSO32_GY_ODR_52Hz_LOW_PW          = 0x13,
} lsm6dso32_odr_g_t;
int32_t lsm6dso32_gy_data_rate_set(const stmdev_ctx_t *ctx,
                                   lsm6dso32_odr_g_t val);
int32_t lsm6dso32_gy_data_rate_get(const stmdev_ctx_t *ctx,
                                   lsm6dso32_odr_g_t *val);

int32_t lsm6dso32_block_data_update_set(const stmdev_ctx_t *ctx,
                                        uint8_t val);
int32_t lsm6dso32_block_data_update_get(const stmdev_ctx_t *ctx,
                                        uint8_t *val);

typedef enum
{
  LSM6DSO32_LSb_1mg  = 0,
  LSM6DSO32_LSb_16mg = 1,
} lsm6dso32_usr_off_w_t;
int32_t lsm6dso32_xl_offset_weight_set(const stmdev_ctx_t *ctx,
                                       lsm6dso32_usr_off_w_t val);
int32_t lsm6dso32_xl_offset_weight_get(const stmdev_ctx_t *ctx,
                                       lsm6dso32_usr_off_w_t *val);

typedef struct
{
  lsm6dso32_all_int_src_t       all_int_src;
  lsm6dso32_wake_up_src_t       wake_up_src;
  lsm6dso32_tap_src_t           tap_src;
  lsm6dso32_d6d_src_t           d6d_src;
  lsm6dso32_status_reg_t        status_reg;
  lsm6dso32_emb_func_status_t   emb_func_status;
  lsm6dso32_fsm_status_a_t      fsm_status_a;
  lsm6dso32_fsm_status_b_t      fsm_status_b;
} lsm6dso32_all_sources_t;
int32_t lsm6dso32_all_sources_get(const stmdev_ctx_t *ctx,
                                  lsm6dso32_all_sources_t *val);

