stm32duino/LSM6DSO32/src/lsm6dso32_reg.h
int32_t lsm6dso32_status_reg_get(const stmdev_ctx_t *ctx,
                                 lsm6dso32_status_reg_t *val);

int32_t lsm6dso32_xl_flag_data_ready_get(const stmdev_ctx_t *ctx,
                                         uint8_t *val);

int32_t lsm6dso32_gy_flag_data_ready_get(const stmdev_ctx_t *ctx,
                                         uint8_t *val);

int32_t lsm6dso32_temp_flag_data_ready_get(const stmdev_ctx_t *ctx,
                                           uint8_t *val);

int32_t lsm6dso32_xl_usr_offset_x_set(const stmdev_ctx_t *ctx,
                                      uint8_t *buff);
int32_t lsm6dso32_xl_usr_offset_x_get(const stmdev_ctx_t *ctx,
                                      uint8_t *buff);

int32_t lsm6dso32_xl_usr_offset_y_set(const stmdev_ctx_t *ctx,
                                      uint8_t *buff);
int32_t lsm6dso32_xl_usr_offset_y_get(const stmdev_ctx_t *ctx,
                                      uint8_t *buff);

int32_t lsm6dso32_xl_usr_offset_z_set(const stmdev_ctx_t *ctx,
                                      uint8_t *buff);
int32_t lsm6dso32_xl_usr_offset_z_get(const stmdev_ctx_t *ctx,
                                      uint8_t *buff);

int32_t lsm6dso32_xl_usr_offset_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso32_xl_usr_offset_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dso32_timestamp_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso32_timestamp_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dso32_timestamp_raw_get(const stmdev_ctx_t *ctx, uint32_t *val);

typedef enum
{
  LSM6DSO32_NO_ROUND      = 0,
  LSM6DSO32_ROUND_XL      = 1,
  LSM6DSO32_ROUND_GY      = 2,
  LSM6DSO32_ROUND_GY_XL   = 3,
} lsm6dso32_rounding_t;
int32_t lsm6dso32_rounding_mode_set(const stmdev_ctx_t *ctx,
                                    lsm6dso32_rounding_t val);
int32_t lsm6dso32_rounding_mode_get(const stmdev_ctx_t *ctx,
                                    lsm6dso32_rounding_t *val);

int32_t lsm6dso32_temperature_raw_get(const stmdev_ctx_t *ctx,
                                      int16_t *val);

int32_t lsm6dso32_angular_rate_raw_get(const stmdev_ctx_t *ctx,
                                       int16_t *val);

int32_t lsm6dso32_acceleration_raw_get(const stmdev_ctx_t *ctx,
                                       int16_t *val);

int32_t lsm6dso32_fifo_out_raw_get(const stmdev_ctx_t *ctx, uint8_t *buff);

int32_t lsm6dso32_number_of_steps_get(const stmdev_ctx_t *ctx,
                                      uint16_t *val);

int32_t lsm6dso32_steps_reset(const stmdev_ctx_t *ctx);

int32_t lsm6dso32_odr_cal_reg_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso32_odr_cal_reg_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LSM6DSO32_USER_BANK           = 0,
  LSM6DSO32_SENSOR_HUB_BANK     = 1,
  LSM6DSO32_EMBEDDED_FUNC_BANK  = 2,
} lsm6dso32_reg_access_t;
int32_t lsm6dso32_mem_bank_set(const stmdev_ctx_t *ctx,
                               lsm6dso32_reg_access_t val);
int32_t lsm6dso32_mem_bank_get(const stmdev_ctx_t *ctx,
                               lsm6dso32_reg_access_t *val);

int32_t lsm6dso32_ln_pg_write_byte(const stmdev_ctx_t *ctx, uint16_t address,
                                   uint8_t *val);
int32_t lsm6dso32_ln_pg_read_byte(const stmdev_ctx_t *ctx, uint16_t address,
                                  uint8_t *val);
int32_t lsm6dso32_ln_pg_write(const stmdev_ctx_t *ctx, uint16_t address,
                              uint8_t *buf, uint8_t len);
int32_t lsm6dso32_ln_pg_read(const stmdev_ctx_t *ctx, uint16_t address, uint8_t *buf,
                             uint8_t len);

typedef enum
{
  LSM6DSO32_DRDY_LATCHED = 0,
  LSM6DSO32_DRDY_PULSED  = 1,
} lsm6dso32_dataready_pulsed_t;
int32_t lsm6dso32_data_ready_mode_set(const stmdev_ctx_t *ctx,
                                      lsm6dso32_dataready_pulsed_t val);
int32_t lsm6dso32_data_ready_mode_get(const stmdev_ctx_t *ctx,
                                      lsm6dso32_dataready_pulsed_t *val);

int32_t lsm6dso32_device_id_get(const stmdev_ctx_t *ctx, uint8_t *buff);

int32_t lsm6dso32_reset_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso32_reset_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dso32_auto_increment_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso32_auto_increment_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dso32_boot_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso32_boot_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LSM6DSO32_XL_ST_DISABLE  = 0,
  LSM6DSO32_XL_ST_POSITIVE = 1,
  LSM6DSO32_XL_ST_NEGATIVE = 2,
} lsm6dso32_st_xl_t;
int32_t lsm6dso32_xl_self_test_set(const stmdev_ctx_t *ctx,
                                   lsm6dso32_st_xl_t val);
int32_t lsm6dso32_xl_self_test_get(const stmdev_ctx_t *ctx,
                                   lsm6dso32_st_xl_t *val);

typedef enum
{
  LSM6DSO32_GY_ST_DISABLE  = 0,
  LSM6DSO32_GY_ST_POSITIVE = 1,
  LSM6DSO32_GY_ST_NEGATIVE = 3,
} lsm6dso32_st_g_t;
int32_t lsm6dso32_gy_self_test_set(const stmdev_ctx_t *ctx,
                                   lsm6dso32_st_g_t val);
int32_t lsm6dso32_gy_self_test_get(const stmdev_ctx_t *ctx,
                                   lsm6dso32_st_g_t *val);

int32_t lsm6dso32_xl_filter_lp2_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso32_xl_filter_lp2_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dso32_gy_filter_lp1_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso32_gy_filter_lp1_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dso32_filter_settling_mask_set(const stmdev_ctx_t *ctx,
                                           uint8_t val);
int32_t lsm6dso32_filter_settling_mask_get(const stmdev_ctx_t *ctx,
                                           uint8_t *val);

typedef enum
{
  LSM6DSO32_ULTRA_LIGHT  = 0,
  LSM6DSO32_VERY_LIGHT   = 1,
  LSM6DSO32_LIGHT        = 2,
  LSM6DSO32_MEDIUM       = 3,
  LSM6DSO32_STRONG       = 4, /* not available for data rate > 1k670Hz */
  LSM6DSO32_VERY_STRONG  = 5, /* not available for data rate > 1k670Hz */
  LSM6DSO32_AGGRESSIVE   = 6, /* not available for data rate > 1k670Hz */
  LSM6DSO32_XTREME       = 7, /* not available for data rate > 1k670Hz */
} lsm6dso32_ftype_t;
int32_t lsm6dso32_gy_lp1_bandwidth_set(const stmdev_ctx_t *ctx,
                                       lsm6dso32_ftype_t val);
int32_t lsm6dso32_gy_lp1_bandwidth_get(const stmdev_ctx_t *ctx,
                                       lsm6dso32_ftype_t *val);

int32_t lsm6dso32_xl_lp2_on_6d_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso32_xl_lp2_on_6d_get(const stmdev_ctx_t *ctx, uint8_t *val);

