stm32duino/LSM6DSO32/src/lsm6dso32_reg.h
typedef enum
{
  LSM6DSO32_HP_PATH_DISABLE_ON_OUT    = 0x00,
  LSM6DSO32_SLOPE_ODR_DIV_4           = 0x10,
  LSM6DSO32_HP_ODR_DIV_10             = 0x11,
  LSM6DSO32_HP_ODR_DIV_20             = 0x12,
  LSM6DSO32_HP_ODR_DIV_45             = 0x13,
  LSM6DSO32_HP_ODR_DIV_100            = 0x14,
  LSM6DSO32_HP_ODR_DIV_200            = 0x15,
  LSM6DSO32_HP_ODR_DIV_400            = 0x16,
  LSM6DSO32_HP_ODR_DIV_800            = 0x17,
  LSM6DSO32_HP_REF_MD_ODR_DIV_10      = 0x31,
  LSM6DSO32_HP_REF_MD_ODR_DIV_20      = 0x32,
  LSM6DSO32_HP_REF_MD_ODR_DIV_45      = 0x33,
  LSM6DSO32_HP_REF_MD_ODR_DIV_100     = 0x34,
  LSM6DSO32_HP_REF_MD_ODR_DIV_200     = 0x35,
  LSM6DSO32_HP_REF_MD_ODR_DIV_400     = 0x36,
  LSM6DSO32_HP_REF_MD_ODR_DIV_800     = 0x37,
  LSM6DSO32_LP_ODR_DIV_10             = 0x01,
  LSM6DSO32_LP_ODR_DIV_20             = 0x02,
  LSM6DSO32_LP_ODR_DIV_45             = 0x03,
  LSM6DSO32_LP_ODR_DIV_100            = 0x04,
  LSM6DSO32_LP_ODR_DIV_200            = 0x05,
  LSM6DSO32_LP_ODR_DIV_400            = 0x06,
  LSM6DSO32_LP_ODR_DIV_800            = 0x07,
} lsm6dso32_hp_slope_xl_en_t;
int32_t lsm6dso32_xl_hp_path_on_out_set(const stmdev_ctx_t *ctx,
                                        lsm6dso32_hp_slope_xl_en_t val);
int32_t lsm6dso32_xl_hp_path_on_out_get(const stmdev_ctx_t *ctx,
                                        lsm6dso32_hp_slope_xl_en_t *val);

int32_t lsm6dso32_xl_fast_settling_set(const stmdev_ctx_t *ctx,
                                       uint8_t val);
int32_t lsm6dso32_xl_fast_settling_get(const stmdev_ctx_t *ctx,
                                       uint8_t *val);

typedef enum
{
  LSM6DSO32_USE_SLOPE = 0,
  LSM6DSO32_USE_HPF   = 1,
} lsm6dso32_slope_fds_t;
int32_t lsm6dso32_xl_hp_path_internal_set(const stmdev_ctx_t *ctx,
                                          lsm6dso32_slope_fds_t val);
int32_t lsm6dso32_xl_hp_path_internal_get(const stmdev_ctx_t *ctx,
                                          lsm6dso32_slope_fds_t *val);

typedef enum
{
  LSM6DSO32_HP_FILTER_NONE     = 0x00,
  LSM6DSO32_HP_FILTER_16mHz    = 0x80,
  LSM6DSO32_HP_FILTER_65mHz    = 0x81,
  LSM6DSO32_HP_FILTER_260mHz   = 0x82,
  LSM6DSO32_HP_FILTER_1Hz04    = 0x83,
} lsm6dso32_hpm_g_t;
int32_t lsm6dso32_gy_hp_path_internal_set(const stmdev_ctx_t *ctx,
                                          lsm6dso32_hpm_g_t val);
int32_t lsm6dso32_gy_hp_path_internal_get(const stmdev_ctx_t *ctx,
                                          lsm6dso32_hpm_g_t *val);

typedef enum
{
  LSM6DSO32_PULL_UP_DISC       = 0,
  LSM6DSO32_PULL_UP_CONNECT    = 1,
} lsm6dso32_sdo_pu_en_t;
int32_t lsm6dso32_sdo_sa0_mode_set(const stmdev_ctx_t *ctx,
                                   lsm6dso32_sdo_pu_en_t val);
int32_t lsm6dso32_sdo_sa0_mode_get(const stmdev_ctx_t *ctx,
                                   lsm6dso32_sdo_pu_en_t *val);

typedef enum
{
  LSM6DSO32_SPI_4_WIRE = 0,
  LSM6DSO32_SPI_3_WIRE = 1,
} lsm6dso32_sim_t;
int32_t lsm6dso32_spi_mode_set(const stmdev_ctx_t *ctx,
                               lsm6dso32_sim_t val);
int32_t lsm6dso32_spi_mode_get(const stmdev_ctx_t *ctx,
                               lsm6dso32_sim_t *val);

typedef enum
{
  LSM6DSO32_I2C_ENABLE  = 0,
  LSM6DSO32_I2C_DISABLE = 1,
} lsm6dso32_i2c_disable_t;
int32_t lsm6dso32_i2c_interface_set(const stmdev_ctx_t *ctx,
                                    lsm6dso32_i2c_disable_t val);
int32_t lsm6dso32_i2c_interface_get(const stmdev_ctx_t *ctx,
                                    lsm6dso32_i2c_disable_t *val);

typedef enum
{
  LSM6DSO32_I3C_DISABLE         = 0x80,
  LSM6DSO32_I3C_ENABLE_T_50us   = 0x00,
  LSM6DSO32_I3C_ENABLE_T_2us    = 0x01,
  LSM6DSO32_I3C_ENABLE_T_1ms    = 0x02,
  LSM6DSO32_I3C_ENABLE_T_25ms   = 0x03,
} lsm6dso32_i3c_disable_t;
int32_t lsm6dso32_i3c_disable_set(const stmdev_ctx_t *ctx,
                                  lsm6dso32_i3c_disable_t val);
int32_t lsm6dso32_i3c_disable_get(const stmdev_ctx_t *ctx,
                                  lsm6dso32_i3c_disable_t *val);

typedef enum
{
  LSM6DSO32_PULL_DOWN_DISC       = 0,
  LSM6DSO32_PULL_DOWN_CONNECT    = 1,
} lsm6dso32_int1_pd_en_t;
int32_t lsm6dso32_int1_mode_set(const stmdev_ctx_t *ctx,
                                lsm6dso32_int1_pd_en_t val);
int32_t lsm6dso32_int1_mode_get(const stmdev_ctx_t *ctx,
                                lsm6dso32_int1_pd_en_t *val);

typedef struct
{
  lsm6dso32_int1_ctrl_t          int1_ctrl;
  lsm6dso32_md1_cfg_t            md1_cfg;
  lsm6dso32_emb_func_int1_t      emb_func_int1;
  lsm6dso32_fsm_int1_a_t         fsm_int1_a;
  lsm6dso32_fsm_int1_b_t         fsm_int1_b;
} lsm6dso32_pin_int1_route_t;
int32_t lsm6dso32_pin_int1_route_set(const stmdev_ctx_t *ctx,
                                     lsm6dso32_pin_int1_route_t *val);
int32_t lsm6dso32_pin_int1_route_get(const stmdev_ctx_t *ctx,
                                     lsm6dso32_pin_int1_route_t *val);

typedef struct
{
  lsm6dso32_int2_ctrl_t          int2_ctrl;
  lsm6dso32_md2_cfg_t            md2_cfg;
  lsm6dso32_emb_func_int2_t      emb_func_int2;
  lsm6dso32_fsm_int2_a_t         fsm_int2_a;
  lsm6dso32_fsm_int2_b_t         fsm_int2_b;
} lsm6dso32_pin_int2_route_t;
int32_t lsm6dso32_pin_int2_route_set(const stmdev_ctx_t *ctx,
                                     lsm6dso32_pin_int2_route_t *val);
int32_t lsm6dso32_pin_int2_route_get(const stmdev_ctx_t *ctx,
                                     lsm6dso32_pin_int2_route_t *val);

typedef enum
{
  LSM6DSO32_PUSH_PULL   = 0,
  LSM6DSO32_OPEN_DRAIN  = 1,
} lsm6dso32_pp_od_t;
int32_t lsm6dso32_pin_mode_set(const stmdev_ctx_t *ctx,
                               lsm6dso32_pp_od_t val);
int32_t lsm6dso32_pin_mode_get(const stmdev_ctx_t *ctx,
                               lsm6dso32_pp_od_t *val);

typedef enum
{
  LSM6DSO32_ACTIVE_HIGH = 0,
  LSM6DSO32_ACTIVE_LOW  = 1,
} lsm6dso32_h_lactive_t;
int32_t lsm6dso32_pin_polarity_set(const stmdev_ctx_t *ctx,
                                   lsm6dso32_h_lactive_t val);
int32_t lsm6dso32_pin_polarity_get(const stmdev_ctx_t *ctx,
                                   lsm6dso32_h_lactive_t *val);

int32_t lsm6dso32_all_on_int1_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso32_all_on_int1_get(const stmdev_ctx_t *ctx, uint8_t *val);

