stm32duino/LSM6DSO32/src/lsm6dso32_reg.h
int32_t lsm6dso32_fifo_full_flag_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dso32_fifo_ovr_flag_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dso32_fifo_wtm_flag_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dso32_fifo_sensor_tag_get(const stmdev_ctx_t *ctx,
                                      lsm6dso32_fifo_tag_t *val);

int32_t lsm6dso32_fifo_pedo_batch_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso32_fifo_pedo_batch_get(const stmdev_ctx_t *ctx,
                                      uint8_t *val);

int32_t lsm6dso32_sh_batch_slave_0_set(const stmdev_ctx_t *ctx,
                                       uint8_t val);
int32_t lsm6dso32_sh_batch_slave_0_get(const stmdev_ctx_t *ctx,
                                       uint8_t *val);

int32_t lsm6dso32_sh_batch_slave_1_set(const stmdev_ctx_t *ctx,
                                       uint8_t val);
int32_t lsm6dso32_sh_batch_slave_1_get(const stmdev_ctx_t *ctx,
                                       uint8_t *val);

int32_t lsm6dso32_sh_batch_slave_2_set(const stmdev_ctx_t *ctx,
                                       uint8_t val);
int32_t lsm6dso32_sh_batch_slave_2_get(const stmdev_ctx_t *ctx,
                                       uint8_t *val);

int32_t lsm6dso32_sh_batch_slave_3_set(const stmdev_ctx_t *ctx,
                                       uint8_t val);
int32_t lsm6dso32_sh_batch_slave_3_get(const stmdev_ctx_t *ctx,
                                       uint8_t *val);

typedef enum
{
  LSM6DSO32_DEN_DISABLE    = 0,
  LSM6DSO32_LEVEL_FIFO     = 6,
  LSM6DSO32_LEVEL_LETCHED  = 3,
  LSM6DSO32_LEVEL_TRIGGER  = 2,
  LSM6DSO32_EDGE_TRIGGER   = 4,
} lsm6dso32_den_mode_t;
int32_t lsm6dso32_den_mode_set(const stmdev_ctx_t *ctx,
                               lsm6dso32_den_mode_t val);
int32_t lsm6dso32_den_mode_get(const stmdev_ctx_t *ctx,
                               lsm6dso32_den_mode_t *val);

typedef enum
{
  LSM6DSO32_DEN_ACT_LOW  = 0,
  LSM6DSO32_DEN_ACT_HIGH = 1,
} lsm6dso32_den_lh_t;
int32_t lsm6dso32_den_polarity_set(const stmdev_ctx_t *ctx,
                                   lsm6dso32_den_lh_t val);
int32_t lsm6dso32_den_polarity_get(const stmdev_ctx_t *ctx,
                                   lsm6dso32_den_lh_t *val);

typedef enum
{
  LSM6DSO32_STAMP_IN_GY_DATA     = 0,
  LSM6DSO32_STAMP_IN_XL_DATA     = 1,
  LSM6DSO32_STAMP_IN_GY_XL_DATA  = 2,
} lsm6dso32_den_xl_g_t;
int32_t lsm6dso32_den_enable_set(const stmdev_ctx_t *ctx,
                                 lsm6dso32_den_xl_g_t val);
int32_t lsm6dso32_den_enable_get(const stmdev_ctx_t *ctx,
                                 lsm6dso32_den_xl_g_t *val);

int32_t lsm6dso32_den_mark_axis_x_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso32_den_mark_axis_x_get(const stmdev_ctx_t *ctx,
                                      uint8_t *val);

int32_t lsm6dso32_den_mark_axis_y_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso32_den_mark_axis_y_get(const stmdev_ctx_t *ctx,
                                      uint8_t *val);

int32_t lsm6dso32_den_mark_axis_z_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso32_den_mark_axis_z_get(const stmdev_ctx_t *ctx,
                                      uint8_t *val);

typedef enum
{
  LSM6DSO32_PEDO_DISABLE              = 0x00,
  LSM6DSO32_PEDO_BASE_MODE            = 0x01,
  LSM6DSO32_PEDO_ADV_MODE             = 0x03,
  LSM6DSO32_FALSE_STEP_REJ            = 0x13,
  LSM6DSO32_FALSE_STEP_REJ_ADV_MODE   = 0x33,
} lsm6dso32_pedo_md_t;
int32_t lsm6dso32_pedo_sens_set(const stmdev_ctx_t *ctx,
                                lsm6dso32_pedo_md_t val);
int32_t lsm6dso32_pedo_sens_get(const stmdev_ctx_t *ctx,
                                lsm6dso32_pedo_md_t *val);

int32_t lsm6dso32_pedo_step_detect_get(const stmdev_ctx_t *ctx,
                                       uint8_t *val);

int32_t lsm6dso32_pedo_debounce_steps_set(const stmdev_ctx_t *ctx,
                                          uint8_t *buff);
int32_t lsm6dso32_pedo_debounce_steps_get(const stmdev_ctx_t *ctx,
                                          uint8_t *buff);

int32_t lsm6dso32_pedo_steps_period_set(const stmdev_ctx_t *ctx,
                                        uint16_t val);
int32_t lsm6dso32_pedo_steps_period_get(const stmdev_ctx_t *ctx,
                                        uint16_t *val);

typedef enum
{
  LSM6DSO32_EVERY_STEP     = 0,
  LSM6DSO32_COUNT_OVERFLOW = 1,
} lsm6dso32_carry_count_en_t;
int32_t lsm6dso32_pedo_int_mode_set(const stmdev_ctx_t *ctx,
                                    lsm6dso32_carry_count_en_t val);
int32_t lsm6dso32_pedo_int_mode_get(const stmdev_ctx_t *ctx,
                                    lsm6dso32_carry_count_en_t *val);

int32_t lsm6dso32_motion_sens_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso32_motion_sens_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dso32_motion_flag_data_ready_get(const stmdev_ctx_t *ctx,
                                             uint8_t *val);

int32_t lsm6dso32_tilt_sens_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso32_tilt_sens_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dso32_tilt_flag_data_ready_get(const stmdev_ctx_t *ctx,
                                           uint8_t *val);

int32_t lsm6dso32_mag_sensitivity_set(const stmdev_ctx_t *ctx,
                                      uint16_t val);
int32_t lsm6dso32_mag_sensitivity_get(const stmdev_ctx_t *ctx,
                                      uint16_t *val);

int32_t lsm6dso32_mag_offset_set(const stmdev_ctx_t *ctx, int16_t *val);
int32_t lsm6dso32_mag_offset_get(const stmdev_ctx_t *ctx, int16_t *val);

int32_t lsm6dso32_mag_soft_iron_set(const stmdev_ctx_t *ctx, int16_t *val);
int32_t lsm6dso32_mag_soft_iron_get(const stmdev_ctx_t *ctx, int16_t *val);

typedef enum
{
  LSM6DSO32_Z_EQ_Y     = 0,
  LSM6DSO32_Z_EQ_MIN_Y = 1,
  LSM6DSO32_Z_EQ_X     = 2,
  LSM6DSO32_Z_EQ_MIN_X = 3,
  LSM6DSO32_Z_EQ_MIN_Z = 4,
  LSM6DSO32_Z_EQ_Z     = 5,
} lsm6dso32_mag_z_axis_t;
int32_t lsm6dso32_mag_z_orient_set(const stmdev_ctx_t *ctx,
                                   lsm6dso32_mag_z_axis_t val);
int32_t lsm6dso32_mag_z_orient_get(const stmdev_ctx_t *ctx,
                                   lsm6dso32_mag_z_axis_t *val);

