stm32duino/LSM6DSO32/src/lsm6dso32_reg.h
typedef enum
{
  LSM6DSO32_Y_EQ_Y     = 0,
  LSM6DSO32_Y_EQ_MIN_Y = 1,
  LSM6DSO32_Y_EQ_X     = 2,
  LSM6DSO32_Y_EQ_MIN_X = 3,
  LSM6DSO32_Y_EQ_MIN_Z = 4,
  LSM6DSO32_Y_EQ_Z     = 5,
} lsm6dso32_mag_y_axis_t;
int32_t lsm6dso32_mag_y_orient_set(const stmdev_ctx_t *ctx,
                                   lsm6dso32_mag_y_axis_t val);
int32_t lsm6dso32_mag_y_orient_get(const stmdev_ctx_t *ctx,
                                   lsm6dso32_mag_y_axis_t *val);

typedef enum
{
  LSM6DSO32_X_EQ_Y     = 0,
  LSM6DSO32_X_EQ_MIN_Y = 1,
  LSM6DSO32_X_EQ_X     = 2,
  LSM6DSO32_X_EQ_MIN_X = 3,
  LSM6DSO32_X_EQ_MIN_Z = 4,
  LSM6DSO32_X_EQ_Z     = 5,
} lsm6dso32_mag_x_axis_t;
int32_t lsm6dso32_mag_x_orient_set(const stmdev_ctx_t *ctx,
                                   lsm6dso32_mag_x_axis_t val);
int32_t lsm6dso32_mag_x_orient_get(const stmdev_ctx_t *ctx,
                                   lsm6dso32_mag_x_axis_t *val);

int32_t lsm6dso32_long_cnt_flag_data_ready_get(const stmdev_ctx_t *ctx,
                                               uint8_t *val);

int32_t lsm6dso32_emb_fsm_en_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso32_emb_fsm_en_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef struct
{
  lsm6dso32_fsm_enable_a_t          fsm_enable_a;
  lsm6dso32_fsm_enable_b_t          fsm_enable_b;
} lsm6dso32_emb_fsm_enable_t;
int32_t lsm6dso32_fsm_enable_set(const stmdev_ctx_t *ctx,
                                 lsm6dso32_emb_fsm_enable_t *val);
int32_t lsm6dso32_fsm_enable_get(const stmdev_ctx_t *ctx,
                                 lsm6dso32_emb_fsm_enable_t *val);

int32_t lsm6dso32_long_cnt_set(const stmdev_ctx_t *ctx, uint16_t val);
int32_t lsm6dso32_long_cnt_get(const stmdev_ctx_t *ctx, uint16_t *val);

typedef enum
{
  LSM6DSO32_LC_NORMAL     = 0,
  LSM6DSO32_LC_CLEAR      = 1,
  LSM6DSO32_LC_CLEAR_DONE = 2,
} lsm6dso32_fsm_lc_clr_t;
int32_t lsm6dso32_long_clr_set(const stmdev_ctx_t *ctx,
                               lsm6dso32_fsm_lc_clr_t val);
int32_t lsm6dso32_long_clr_get(const stmdev_ctx_t *ctx,
                               lsm6dso32_fsm_lc_clr_t *val);

typedef struct
{
  lsm6dso32_fsm_outs1_t    fsm_outs1;
  lsm6dso32_fsm_outs2_t    fsm_outs2;
  lsm6dso32_fsm_outs3_t    fsm_outs3;
  lsm6dso32_fsm_outs4_t    fsm_outs4;
  lsm6dso32_fsm_outs5_t    fsm_outs5;
  lsm6dso32_fsm_outs6_t    fsm_outs6;
  lsm6dso32_fsm_outs7_t    fsm_outs7;
  lsm6dso32_fsm_outs8_t    fsm_outs8;
  lsm6dso32_fsm_outs1_t    fsm_outs9;
  lsm6dso32_fsm_outs2_t    fsm_outs10;
  lsm6dso32_fsm_outs3_t    fsm_outs11;
  lsm6dso32_fsm_outs4_t    fsm_outs12;
  lsm6dso32_fsm_outs5_t    fsm_outs13;
  lsm6dso32_fsm_outs6_t    fsm_outs14;
  lsm6dso32_fsm_outs7_t    fsm_outs15;
  lsm6dso32_fsm_outs8_t    fsm_outs16;
} lsm6dso32_fsm_out_t;
int32_t lsm6dso32_fsm_out_get(const stmdev_ctx_t *ctx,
                              lsm6dso32_fsm_out_t *val);

typedef enum
{
  LSM6DSO32_ODR_FSM_12Hz5 = 0,
  LSM6DSO32_ODR_FSM_26Hz  = 1,
  LSM6DSO32_ODR_FSM_52Hz  = 2,
  LSM6DSO32_ODR_FSM_104Hz = 3,
} lsm6dso32_fsm_odr_t;
int32_t lsm6dso32_fsm_data_rate_set(const stmdev_ctx_t *ctx,
                                    lsm6dso32_fsm_odr_t val);
int32_t lsm6dso32_fsm_data_rate_get(const stmdev_ctx_t *ctx,
                                    lsm6dso32_fsm_odr_t *val);

int32_t lsm6dso32_fsm_init_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso32_fsm_init_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dso32_long_cnt_int_value_set(const stmdev_ctx_t *ctx,
                                         uint16_t val);
int32_t lsm6dso32_long_cnt_int_value_get(const stmdev_ctx_t *ctx,
                                         uint16_t *val);

int32_t lsm6dso32_fsm_number_of_programs_set(const stmdev_ctx_t *ctx,
                                             uint8_t *buff);
int32_t lsm6dso32_fsm_number_of_programs_get(const stmdev_ctx_t *ctx,
                                             uint8_t *buff);

int32_t lsm6dso32_fsm_start_address_set(const stmdev_ctx_t *ctx,
                                        uint16_t val);
int32_t lsm6dso32_fsm_start_address_get(const stmdev_ctx_t *ctx,
                                        uint16_t *val);

typedef struct
{
  lsm6dso32_sensor_hub_1_t   sh_byte_1;
  lsm6dso32_sensor_hub_2_t   sh_byte_2;
  lsm6dso32_sensor_hub_3_t   sh_byte_3;
  lsm6dso32_sensor_hub_4_t   sh_byte_4;
  lsm6dso32_sensor_hub_5_t   sh_byte_5;
  lsm6dso32_sensor_hub_6_t   sh_byte_6;
  lsm6dso32_sensor_hub_7_t   sh_byte_7;
  lsm6dso32_sensor_hub_8_t   sh_byte_8;
  lsm6dso32_sensor_hub_9_t   sh_byte_9;
  lsm6dso32_sensor_hub_10_t  sh_byte_10;
  lsm6dso32_sensor_hub_11_t  sh_byte_11;
  lsm6dso32_sensor_hub_12_t  sh_byte_12;
  lsm6dso32_sensor_hub_13_t  sh_byte_13;
  lsm6dso32_sensor_hub_14_t  sh_byte_14;
  lsm6dso32_sensor_hub_15_t  sh_byte_15;
  lsm6dso32_sensor_hub_16_t  sh_byte_16;
  lsm6dso32_sensor_hub_17_t  sh_byte_17;
  lsm6dso32_sensor_hub_18_t  sh_byte_18;
} lsm6dso32_emb_sh_read_t;
int32_t lsm6dso32_sh_read_data_raw_get(const stmdev_ctx_t *ctx,
                                       lsm6dso32_emb_sh_read_t *val);

typedef enum
{
  LSM6DSO32_SLV_0       = 0,
  LSM6DSO32_SLV_0_1     = 1,
  LSM6DSO32_SLV_0_1_2   = 2,
  LSM6DSO32_SLV_0_1_2_3 = 3,
} lsm6dso32_aux_sens_on_t;
int32_t lsm6dso32_sh_slave_connected_set(const stmdev_ctx_t *ctx,
                                         lsm6dso32_aux_sens_on_t val);
int32_t lsm6dso32_sh_slave_connected_get(const stmdev_ctx_t *ctx,
                                         lsm6dso32_aux_sens_on_t *val);

int32_t lsm6dso32_sh_master_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso32_sh_master_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LSM6DSO32_EXT_PULL_UP      = 0,
  LSM6DSO32_INTERNAL_PULL_UP = 1,
} lsm6dso32_shub_pu_en_t;
int32_t lsm6dso32_sh_pin_mode_set(const stmdev_ctx_t *ctx,
                                  lsm6dso32_shub_pu_en_t val);
int32_t lsm6dso32_sh_pin_mode_get(const stmdev_ctx_t *ctx,
                                  lsm6dso32_shub_pu_en_t *val);

int32_t lsm6dso32_sh_pass_through_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso32_sh_pass_through_get(const stmdev_ctx_t *ctx,
                                      uint8_t *val);

