stm32duino/LSM6DSO32/src/lsm6dso32_reg.h
typedef enum
{
  LSM6DSO32_EXT_ON_INT2_PIN = 1,
  LSM6DSO32_XL_GY_DRDY      = 0,
} lsm6dso32_start_config_t;
int32_t lsm6dso32_sh_syncro_mode_set(const stmdev_ctx_t *ctx,
                                     lsm6dso32_start_config_t val);
int32_t lsm6dso32_sh_syncro_mode_get(const stmdev_ctx_t *ctx,
                                     lsm6dso32_start_config_t *val);

typedef enum
{
  LSM6DSO32_EACH_SH_CYCLE    = 0,
  LSM6DSO32_ONLY_FIRST_CYCLE = 1,
} lsm6dso32_write_once_t;
int32_t lsm6dso32_sh_write_mode_set(const stmdev_ctx_t *ctx,
                                    lsm6dso32_write_once_t val);
int32_t lsm6dso32_sh_write_mode_get(const stmdev_ctx_t *ctx,
                                    lsm6dso32_write_once_t *val);

int32_t lsm6dso32_sh_reset_set(const stmdev_ctx_t *ctx);
int32_t lsm6dso32_sh_reset_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LSM6DSO32_SH_ODR_104Hz = 0,
  LSM6DSO32_SH_ODR_52Hz  = 1,
  LSM6DSO32_SH_ODR_26Hz  = 2,
  LSM6DSO32_SH_ODR_13Hz  = 3,
} lsm6dso32_shub_odr_t;
int32_t lsm6dso32_sh_data_rate_set(const stmdev_ctx_t *ctx,
                                   lsm6dso32_shub_odr_t val);
int32_t lsm6dso32_sh_data_rate_get(const stmdev_ctx_t *ctx,
                                   lsm6dso32_shub_odr_t *val);

typedef struct
{
  uint8_t   slv0_add;
  uint8_t   slv0_subadd;
  uint8_t   slv0_data;
} lsm6dso32_sh_cfg_write_t;
int32_t lsm6dso32_sh_cfg_write(const stmdev_ctx_t *ctx,
                               lsm6dso32_sh_cfg_write_t *val);

typedef struct
{
  uint8_t   slv_add;
  uint8_t   slv_subadd;
  uint8_t   slv_len;
} lsm6dso32_sh_cfg_read_t;
int32_t lsm6dso32_sh_slv0_cfg_read(const stmdev_ctx_t *ctx,
                                   lsm6dso32_sh_cfg_read_t *val);
int32_t lsm6dso32_sh_slv1_cfg_read(const stmdev_ctx_t *ctx,
                                   lsm6dso32_sh_cfg_read_t *val);
int32_t lsm6dso32_sh_slv2_cfg_read(const stmdev_ctx_t *ctx,
                                   lsm6dso32_sh_cfg_read_t *val);
int32_t lsm6dso32_sh_slv3_cfg_read(const stmdev_ctx_t *ctx,
                                   lsm6dso32_sh_cfg_read_t *val);

int32_t lsm6dso32_sh_status_get(const stmdev_ctx_t *ctx,
                                lsm6dso32_status_master_t *val);

/**
  * @}
  *
  */

#ifdef __cplusplus
}
#endif

#endif /*LSM6DSO32_DRIVER_H */
